{
  "internet": "Rede mundial que conecta computadores e celulares, permitindo acessar sites e trocar informações.",
  "intranet": "Rede interna usada dentro de empresas e acessada apenas por funcionários.",
  "extranet": "Versão da intranet que permite acesso limitado a pessoas externas, como parceiros.",
  "http": "Protocolo usado para carregar páginas da web.",
  "https": "Versão segura do HTTP, que protege os dados enviados e recebidos.",
  "url": "Endereço de um site, como 'https://google.com'.",
  "dominio": "Nome que identifica um site na internet.",
  "dns": "Sistema que converte o nome do site (domínio) no endereço IP correto.",
  "hosting": "Serviço onde sites e sistemas ficam armazenados.",
  "api": "Forma de comunicação entre sistemas.",
  "endpoint": "Endereço específico dentro de uma API.",
  "rest": "Modelo simples para criar APIs na web.",
  "graphql": "Tecnologia moderna e flexível para APIs.",
  "cookie": "Arquivo pequeno usado para lembrar preferências do usuário.",
  "session": "Informação temporária que identifica um usuário logado.",
  "jwt": "Token seguro usado para autenticação.",
  "cors": "Regra que permite ou bloqueia acesso entre diferentes sites.",
  "cdn": "Rede de servidores que acelera o carregamento de sites.",
  "frontend": "Parte visual do sistema, onde o usuário interage.",
  "html": "Linguagem usada para estruturar o conteúdo da página.",
  "css": "Linguagem que define aparência, cores e layout do site.",
  "javascript": "Linguagem que adiciona interatividade nas páginas.",
  "react": "Ferramenta moderna para criar interfaces de usuário.",
  "vue": "Framework simples e progressivo para interfaces.",
  "bootstrap": "Biblioteca com componentes prontos como botões e menus.",
  "tailwind": "Biblioteca de estilos rápida e moderna.",
  "dom": "Estrutura da página manipulada pelo JavaScript.",
  "backend": "Parte do sistema responsável pela lógica e banco de dados.",
  "node": "Plataforma que permite rodar JavaScript no backend.",
  "npm": "Gerenciador de pacotes do Node.",
  "express": "Framework simples para criar APIs em Node.",
  "python": "Linguagem versátil usada para sistemas, automação e IA.",
  "django": "Framework completo para criar sites e APIs.",
  "flask": "Framework leve para APIs simples.",
  "fastapi": "Framework moderno e rápido para APIs.",
  "php": "Linguagem usada em sites e sistemas web.",
  "laravel": "Framework moderno para PHP.",
  "java": "Linguagem amplamente usada em grandes sistemas.",
  "spring": "Framework robusto para aplicações em Java.",
  "sql": "Linguagem usada para consultar bancos de dados.",
  "mysql": "Banco de dados muito usado em sistemas e sites.",
  "postgres": "Banco de dados avançado, profissional e confiável.",
  "sqlite": "Banco leve que salva dados em arquivos.",
  "mongodb": "Banco NoSQL que salva dados de forma flexível.",
  "redis": "Banco muito rápido usado para cache e filas.",
  "prisma": "ORM moderno para trabalhar com bancos usando código.",
  "orm": "Tecnologia que transforma tabelas em objetos do código.",
  "migrations": "Arquivos que guardam as mudanças feitas no banco.",
  "schema": "Estrutura da tabela ou banco de dados.",
  "primary_key": "Identificador único da linha de uma tabela.",
  "foreign_key": "Chave que liga duas tabelas diferentes.",
  "mvc": "Modelo que separa o sistema em: Model, View e Controller.",
  "mvp": "Arquitetura parecida com MVC, organizada em camadas.",
  "clean_architecture": "Forma de organizar o código separando regras de negócio.",
  "microservices": "Arquitetura onde o sistema é dividido em pequenos serviços.",
  "monolith": "Sistema inteiro em um único bloco.",
  "solid": "Conjunto de boas práticas para escrever código melhor.",
  "scalability": "Capacidade do sistema crescer sem perder desempenho.",
  "docker": "Tecnologia que empacota aplicações com tudo o que precisam.",
  "dockerfile": "Arquivo que define como criar a imagem Docker.",
  "docker_compose": "Ferramenta para rodar vários containers juntos.",
  "kubernetes": "Sistema que gerencia containers em larga escala.",
  "container": "Pacote leve que contém tudo para rodar uma aplicação.",
  "aws": "Plataforma de computação em nuvem da Amazon.",
  "azure": "Plataforma de nuvem da Microsoft.",
  "gcp": "Plataforma de nuvem da Google.",
  "load_balancer": "Distribui acessos entre vários servidores.",
  "firewall": "Barreira de proteção que bloqueia acessos indesejados.",
  "criptografia": "Processo de embaralhar informações para proteger dados.",
  "hash": "Código único gerado a partir de um dado.",
  "vpn": "Conexão segura que protege sua navegação.",
  "phishing": "Golpe que tenta enganar pessoas para roubar informações.",
  "xss": "Ataque que insere códigos maliciosos em páginas.",
  "csrf": "Ataque que faz ações indesejadas sem o usuário perceber.",
  "variavel": "Espaço que guarda um valor no código.",
  "funcao": "Bloco de código que realiza uma tarefa específica.",
  "classe": "Modelo que define como criar objetos.",
  "objeto": "Entidade criada a partir de uma classe.",
  "interface": "Conjunto de regras que uma classe deve seguir.",
  "heranca": "Quando uma classe aproveita características de outra.",
  "polimorfismo": "Objetos diferentes podem agir de maneira parecida.",
  "exception": "Erro que pode ser tratado no código.",
  "loop": "Repetição de código até uma condição ser atendida.",
  "lista": "Coleção de valores armazenados em ordem.",
  "dicionario": "Estrutura que guarda pares de chave e valor.",
  "json": "Formato de dados simples e fácil de ler.",
  "test_unitario": "Teste que verifica se uma pequena parte do código funciona.",
  "test_integracao": "Teste que verifica partes juntas funcionando.",
  "mock": "Simulação usada em testes.",
  "tdd": "Forma de programar começando pelos testes.",
  "serverless": "Execução de código sem precisar gerenciar servidores.",
  "lambda": "Funções executadas sob demanda na AWS.",
  "s3": "Serviço de armazenamento de arquivos da AWS.",
  "git": "Sistema de controle de versão para código.",
  "github": "Site onde repositórios Git ficam hospedados.",
  "branch": "Linha paralela de desenvolvimento.",
  "merge": "Ação de juntar duas linhas de código.",
  "commit": "Registro de uma mudança feita no código.",
  "pull_request": "Pedido de revisão e aprovação de alterações."
}
